case/outputs_shutin/openfoam_cases/section_2_x15p3km/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| SHCT->OpenFOAM coupling — auto-generated case                              |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 2 -2 0 0 0 0];
internalField uniform 9.50893e-05;

boundaryField
{
    inlet   { type fixedValue; value uniform 9.50893e-05; }
    outlet  { type inletOutlet; inletValue uniform 9.50893e-05; value uniform 9.50893e-05; }
    walls   { type kqRWallFunction; value uniform 9.50893e-05; }
}
