case/outputs_shutin/openfoam_cases/section_2_x15p3km/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| SHCT->OpenFOAM coupling — auto-generated case                              |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 0 -1 0 0 0 0];
internalField uniform 1.66559;

boundaryField
{
    inlet   { type fixedValue; value uniform 1.66559; }
    outlet  { type inletOutlet; inletValue uniform 1.66559; value uniform 1.66559; }
    walls   { type omegaWallFunction; value uniform 1.66559; }
}
